Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map.certificates has changed
! resource "google_certificate_manager_certificate_map" "certificates" {
!       gclb_targets     = [
+           {
+               ip_configs         = [
+                   {
+                       ip_address = "34.102.145.86"
+                       ports      = [
                          + 443,
                        ]
                    },
                ]
+               target_https_proxy = "//compute.googleapis.com/projects/993744606360/global/targetHttpsProxies/broadinstitute-misspell-https-ab0082c5"
                # (1 unchanged attribute hidden)
            },
        ]
        id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-misspell-ab0082c5"
        name             = "broadinstitute-misspell-ab0082c5"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

  # module.http_redirects["broadinstitute-misspell"].google_compute_url_map.https_url_map will be updated in-place
! resource "google_compute_url_map" "https_url_map" {
        id                 = "projects/broad-redirect-prod/global/urlMaps/broadinstitute-misspell-https-ab0082c5"
        name               = "broadinstitute-misspell-https-ab0082c5"
        # (7 unchanged attributes hidden)

-       host_rule {
-           hosts        = [
-               "broadinsitute.org",
-               "www.broadinsitute.org",
            ] -> null
-           path_matcher = "allpaths" -> null
            # (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "broadinsitute.org",
+               "broadinstittute.org",
+               "broadinstitute-mit.org",
+               "broadintitute.com",
+               "broadintitute.org",
+               "broadlinstitute.com",
+               "broadlinstitute.net",
+               "broadlinstitute.org",
+               "broadlnstitute.com",
+               "broadlnstitute.net",
+               "broadlnstitute.org",
+               "broadlntitute.com",
+               "broadlntitute.org",
+               "broadnstitute.org",
+               "www.broadinsitute.org",
+               "www.broadinstittute.org",
+               "www.broadinstitute-mit.org",
+               "www.broadintitute.com",
+               "www.broadintitute.org",
+               "www.broadlinstitute.com",
+               "www.broadlinstitute.net",
+               "www.broadlinstitute.org",
+               "www.broadlnstitute.com",
+               "www.broadlnstitute.net",
+               "www.broadlnstitute.org",
+               "www.broadlntitute.com",
+               "www.broadlntitute.org",
+               "www.broadnstitute.org",
            ]
+           path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadinstittute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstittute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstittute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadinstittute.org",
+               "www.broadinstittute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadinstitute-mit.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadinstitute-mit.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadinstitute-mit-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadinstitute-mit.org",
+               "www.broadinstitute-mit.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadintitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadintitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadintitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadintitute.com",
+               "www.broadintitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadintitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadintitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadintitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadintitute.org",
+               "www.broadintitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlinstitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlinstitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlinstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlinstitute.com",
+               "www.broadlinstitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlinstitute.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlinstitute.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlinstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlinstitute.net",
+               "www.broadlinstitute.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlinstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlinstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlinstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlinstitute.org",
+               "www.broadlinstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlnstitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlnstitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlnstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlnstitute.com",
+               "www.broadlnstitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlnstitute.net"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlnstitute.net"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlnstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlnstitute.net",
+               "www.broadlnstitute.net",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlnstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlnstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlnstitute.org",
+               "www.broadlnstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlntitute.com"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlntitute.com"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlntitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlntitute.com",
+               "www.broadlntitute.com",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadlntitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadlntitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadlntitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadlntitute.org",
+               "www.broadlntitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate.certificates["broadnstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broadnstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broadnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = []
+           domains                    = [
+               "broadnstitute.org",
+               "www.broadnstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstittute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstittute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstittute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadinstittute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadinstitute-mit.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute-mit.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadinstitute-mit.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadinstitute-mit-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadintitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadintitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadintitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadintitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadintitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadintitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadintitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadintitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlinstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlinstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlinstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlnstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlnstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlnstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlnstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlnstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlnstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlnstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlnstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlntitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlntitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlntitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlntitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadlntitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlntitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadlntitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadlntitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broadnstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadnstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broadnstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "broadnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstittute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstittute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstittute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadinstittute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadinstitute-mit.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadinstitute-mit.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadinstitute-mit.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadinstitute-mit-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadintitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadintitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadintitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadintitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadintitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadintitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadintitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadintitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlinstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlinstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlinstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlinstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlinstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlinstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlinstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlnstitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlnstitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlnstitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlnstitute.net"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.net"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlnstitute.net"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlnstitute-net-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlnstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlnstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlnstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlntitute.com"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlntitute.com"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlntitute.com"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlntitute-com-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadlntitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadlntitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadlntitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadlntitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-misspell"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broadnstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broadnstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broadnstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-misspell-ab0082c5"
+       name             = "www-broadnstitute-org-ab0082c5"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

Plan: 39 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```

**Note: Objects have changed outside of Terraform**
Plan: 39 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```